# Задача 3. Найдите все простые несократимые дроби, 
# лежащие между 0 и 1, знаменатель которых не превышает 11.
list_numerator = list(range(1,11))
print(list_numerator)
list_denominator = list(range(1,12))
print(list_denominator)
if num%dem !=0:
    